In [1]:
import numpy as np 
import pandas as pd 

from pandas import Series,DataFrame

In [2]:
ser1=Series(np.arange(3),index=['A','B','C'])

ser1=2*ser1

ser1

A    0
B    2
C    4
dtype: int64

In [3]:
ser1['B']

2

In [4]:
dframe=DataFrame(np.arange(25).reshape((5,5)),index=['AA','LARSA','CHALKI','ATH','SKG'],columns=['A','B','C','D','E'])

dframe

         A   B   C   D   E
AA       0   1   2   3   4
LARSA    5   6   7   8   9
CHALKI  10  11  12  13  14
ATH     15  16  17  18  19
SKG     20  21  22  23  24

In [5]:
dframe['B']

AA         1
LARSA      6
CHALKI    11
ATH       16
SKG       21
Name: B, dtype: int64

In [6]:
dframe[dframe['C']>8]

         A   B   C   D   E
CHALKI  10  11  12  13  14
ATH     15  16  17  18  19
SKG     20  21  22  23  24

In [7]:
dframe>10

            A      B      C      D      E
AA      False  False  False  False  False
LARSA   False  False  False  False  False
CHALKI  False   True   True   True   True
ATH      True   True   True   True   True
SKG      True   True   True   True   True

In [11]:
dframe.index[1]

'LARSA'